module.exports = {
    API_URL_WEBHOOK: 'https://periodic-cat-facts.appspot.com/discord/post',
    API_URL_DANK: 'https://www.cannabisreports.com/api/v1.0/strains',

    ID_WEBHOOK_GENERAL: '333124932651450378',

    DEFAULT_AVATAR_URL: 'https://cdn.discordapp.com/avatars/333124932651450378/2b1809b5500ac1d4e0aaeb8f1ee11efd.png',

    MAX_MSG_LEN: 2000,

    EXIT_CODES: {
        'SIGTERM': 9,
        'SIGINT': 0,
        'UncaughtException': 1
    },

    EMOJI_FACES: [
        '😀', '😁', '😂', '🤣', '😃', '😄', '😅', '😆', '😉', '😊', '😋',
        '😎', '😍', '😘', '😗', '😙', '😚', '☺', '🙂', '🤗', '🤔', '😐',
        '😑', '😶', '🙄', '😏', '😣', '😥', '😮', '🤐', '😯', '😪', '😫',
        '😴', '😌', '😛', '😜', '😝', '🤤', '😒', '😓', '😔', '😕', '🙃',
        '🤑', '😲', '☹', '🙁', '😖', '😞', '😟', '😤', '😢', '😭', '😦',
        '😧', '😨', '😩', '😬', '😰', '😱', '😳', '😵', '😡', '😠', '😷',
        '🤒', '🤕', '🤢', '🤧', '😇', '🤠', '🤡', '🤥', '🤓', '😈', '👿',
        '👹', '👺', '💀', '☠', '👻', '👽', '👾', '🤖', '💩', '😺', '😸',
        '😹', '😻', '😼', '😽', '🙀', '😿', '😾', '🙈', '🙉', '🙊'
    ],
    EMOJI_SYMBOLS: [
        '⛔', '⚠', '🚸', '☢', '☣', '💢', '💮', '🛑'
    ],
    MSG_TRIGGER_TEXTS: [
        // trigger words go here
    ],
    MSG_TRIGGER_HASHTAGS: [
        // trigger hashtags go here
    ],
    MSG_DRINKS: [
        // drinks of the night go here
    ]
};
